#SQL

##Task 1
Query all columns for a city in CITY with the ID 1661.

Input Format

The CITY table is described as follows: <br>
<img src = "https://s3.amazonaws.com/hr-challenge-images/8137/1449729804-f21d187d0f-CITY.jpg">

1.   List item
2.   List item

In [4]:
import sqlite3
conn = sqlite3.connect('chinook.db')

import pandas as pd

createQuery = """CREATE TABLE IF NOT EXISTS CITY (
  ID NUMBER PRIMARY KEY,
  NAME VARCHAR2(17),
  COUNTRYCODE VARCHAR2(3),
  DISTRICT VARCHAR2(20),
  POPULATION NUMBER
);
"""
cur = conn.cursor()
cur.execute(createQuery)
cur.close()

insertQuery = """INSERT INTO CITY(ID, NAME, COUNTRYCODE, DISTRICT, POPULATION) VALUES (1661, 'TUYEN QUANG', 'VN', 'TP TUYEN QUANG', '100000');"""
cur = conn.cursor()
cur.execute(insertQuery)
cur.close()

data = pd.read_sql_query('SELECT * FROM CITY WHERE ID = 1661;', conn)
data.head()

     ID         NAME COUNTRYCODE        DISTRICT  POPULATION
0  1661  TUYEN QUANG          VN  TP TUYEN QUANG      100000

##Task 2
Query all columns for all American cities in CITY with populations larger than 100000. The CountryCode for America is USA.

Input Format<br>
<img src = "https://s3.amazonaws.com/hr-challenge-images/8137/1449729804-f21d187d0f-CITY.jpg">

In [5]:
import sqlite3
conn = sqlite3.connect('chinook.db')

import pandas as pd

createQuery = """CREATE TABLE IF NOT EXISTS CITY (
  ID NUMBER PRIMARY KEY,
  NAME VARCHAR2(17),
  COUNTRYCODE VARCHAR2(3),
  DISTRICT VARCHAR2(20),
  POPULATION NUMBER
);
"""
cur = conn.cursor()
cur.execute(createQuery)
cur.close()

insertQuery = """INSERT INTO CITY(ID, NAME, COUNTRYCODE, DISTRICT, POPULATION) 
                VALUES (1234, 'California', 'USA', 'Los Angeles', '2000000');"""
cur = conn.cursor()
cur.execute(insertQuery)
cur.close()

data = pd.read_sql_query('SELECT * FROM CITY WHERE COUNTRYCODE = \'USA\' AND POPULATION > 100000;', conn)
data.head()

     ID        NAME COUNTRYCODE     DISTRICT  POPULATION
0  1234  California         USA  Los Angeles     2000000

##Task 3
Query all attributes of every Japanese city in the CITY table. The COUNTRYCODE for Japan is JPN.

Input Format:<br>
<img src = "https://s3.amazonaws.com/hr-challenge-images/8137/1449729804-f21d187d0f-CITY.jpg">

In [6]:
import sqlite3
conn = sqlite3.connect('chinook.db')

import pandas as pd

createQuery = """CREATE TABLE IF NOT EXISTS CITY (
  ID NUMBER PRIMARY KEY,
  NAME VARCHAR2(17),
  COUNTRYCODE VARCHAR2(3),
  DISTRICT VARCHAR2(20),
  POPULATION NUMBER
);
"""
cur = conn.cursor()
cur.execute(createQuery)
cur.close()

insertQuery = """INSERT INTO CITY(ID, NAME, COUNTRYCODE, DISTRICT, POPULATION) 
                VALUES (12345, 'Tokyo', 'JPN', 'Tokyo', '12345678');"""
cur = conn.cursor()
cur.execute(insertQuery)
cur.close()

data = pd.read_sql_query('SELECT * FROM CITY WHERE COUNTRYCODE = \'JPN\';', conn)
data.head()

      ID   NAME COUNTRYCODE DISTRICT  POPULATION
0  12345  Tokyo         JPN    Tokyo    12345678

##Task 4
Query the names of all the Japanese cities in the CITY table. The COUNTRYCODE for Japan is JPN.

Input Format<br>
<img src = "https://s3.amazonaws.com/hr-challenge-images/8137/1449729804-f21d187d0f-CITY.jpg">

In [7]:
import sqlite3
conn = sqlite3.connect('chinook.db')

import pandas as pd

createQuery = """CREATE TABLE IF NOT EXISTS CITY (
  ID NUMBER PRIMARY KEY,
  NAME VARCHAR2(17),
  COUNTRYCODE VARCHAR2(3),
  DISTRICT VARCHAR2(20),
  POPULATION NUMBER
);
"""
cur = conn.cursor()
cur.execute(createQuery)
cur.close()

insertQuery = """INSERT INTO CITY(ID, NAME, COUNTRYCODE, DISTRICT, POPULATION) 
                VALUES (12345, 'Tokyo', 'JPN', 'Tokyo', '12345678');"""
cur = conn.cursor()
cur.execute(insertQuery)
cur.close()

data = pd.read_sql_query('SELECT NAME FROM CITY WHERE COUNTRYCODE = \'JPN\';', conn)
data.head()

    NAME
0  Tokyo

##Task 5
Query a list of CITY and STATE from the STATION table.

Input Format

The STATION table is described as follows:<br>
<img src = 'https://s3.amazonaws.com/hr-challenge-images/9336/1449345840-5f0a551030-Station.jpg'>

In [8]:
import sqlite3
conn = sqlite3.connect('chinook.db')

import pandas as pd

createQuery = """CREATE TABLE IF NOT EXISTS CITY (
  ID NUMBER PRIMARY KEY,
  NAME VARCHAR2(17),
  COUNTRYCODE VARCHAR2(3),
  DISTRICT VARCHAR2(20),
  POPULATION NUMBER
);
"""
cur = conn.cursor()
cur.execute(createQuery)
cur.close()

createStationQuery = """CREATE TABLE IF NOT EXISTS STATION (
  ID NUMBER PRIMARY KEY,
  CITY VARCHAR2(21),
  STATE VARCHAR2(2),
  LAT_N NUMBER,
  LONG_W NUMBER
);
"""
cur = conn.cursor()
cur.execute(createStationQuery)
cur.close()

insertQuery = """INSERT INTO STATION(ID, CITY, STATE, LAT_N, LONG_W) 
                VALUES (12, 'Tokyo', 'TOKYO', 12345, 54321);"""
cur = conn.cursor()
cur.execute(insertQuery)
cur.close()

data = pd.read_sql_query('SELECT CITY, STATE FROM STATION;', conn)
data.head()

    CITY  STATE
0  Tokyo  TOKYO

##Task 6
Query a list of CITY names from STATION with even ID numbers only. You may print the results in any order, but must exclude duplicates from your answer.

Input Format

The STATION table is described as follows:<br>
<img src ="https://s3.amazonaws.com/hr-challenge-images/9336/1449345840-5f0a551030-Station.jpg">

In [11]:
import sqlite3
conn = sqlite3.connect('chinook.db')

import pandas as pd

createQuery = """CREATE TABLE IF NOT EXISTS CITY (
  ID NUMBER PRIMARY KEY,
  NAME VARCHAR2(17),
  COUNTRYCODE VARCHAR2(3),
  DISTRICT VARCHAR2(20),
  POPULATION NUMBER
);
"""
cur = conn.cursor()
cur.execute(createQuery)
cur.close()

createStationQuery = """CREATE TABLE IF NOT EXISTS STATION (
  ID NUMBER PRIMARY KEY,
  CITY VARCHAR2(21),
  STATE VARCHAR2(2),
  LAT_N NUMBER,
  LONG_W NUMBER
);
"""
cur = conn.cursor()
cur.execute(createStationQuery)
cur.close()

insertQuery = """INSERT INTO STATION(ID, CITY, STATE, LAT_N, LONG_W) 
                VALUES (12, 'Tokyo', 'TOKYO', 12345, 54321), 
                (13, 'Kyoto', 'Kyoto', 12345, 54321),
                (14, 'Tokyo', 'TOKYO', 12345, 54321);"""
cur = conn.cursor()
cur.execute(insertQuery)
cur.close()

data = pd.read_sql_query('SELECT DISTINCT CITY FROM STATION WHERE ID % 2 = 0;', conn)
data.head()

    CITY
0  Tokyo
1  Tokyo

Let  be the number of CITY entries in STATION, and let  be the number of distinct CITY names in STATION; query the value of  from STATION. In other words, find the difference between the total number of CITY entries in the table and the number of distinct CITY entries in the table.

Input Format

The STATION table is described as follows:<br>
<img src = "https://s3.amazonaws.com/hr-challenge-images/9336/1449345840-5f0a551030-Station.jpg"><br>
where LAT_N is the northern latitude and LONG_W is the western longitude.

In [15]:
import sqlite3
conn = sqlite3.connect('chinook.db')

import pandas as pd

createQuery = """CREATE TABLE IF NOT EXISTS CITY (
  ID NUMBER PRIMARY KEY,
  NAME VARCHAR2(17),
  COUNTRYCODE VARCHAR2(3),
  DISTRICT VARCHAR2(20),
  POPULATION NUMBER
);
"""
cur = conn.cursor()
cur.execute(createQuery)
cur.close()

createStationQuery = """CREATE TABLE IF NOT EXISTS STATION (
  ID NUMBER PRIMARY KEY,
  CITY VARCHAR2(21),
  STATE VARCHAR2(2),
  LAT_N NUMBER,
  LONG_W NUMBER
);
"""
cur = conn.cursor()
cur.execute(createStationQuery)
cur.close()

insertQuery = """INSERT INTO STATION(ID, CITY, STATE, LAT_N, LONG_W) 
                VALUES (12, 'Tokyo', 'TOKYO', 12345, 54321), 
                (13, 'Kyoto', 'Kyoto', 12345, 54321),
                (14, 'Tokyo', 'TOKYO', 12345, 54321);"""
cur = conn.cursor()
cur.execute(insertQuery)
cur.close()

data = pd.read_sql_query('SELECT ((SELECT COUNT(CITY) FROM STATION) - (SELECT COUNT(DISTINCT CITY) FROM STATION)) as diff;', conn)
data.head()

   diff
0     1

##Task 7
Query the two cities in STATION with the shortest and longest CITY names, as well as their respective lengths (i.e.: number of characters in the name). If there is more than one smallest or largest city, choose the one that comes first when ordered alphabetically.

Input Format

The STATION table is described as follows:<br>
  <img src = "https://s3.amazonaws.com/hr-challenge-images/9336/1449345840-5f0a551030-Station.jpg">

In [16]:
import sqlite3
conn = sqlite3.connect('chinook.db')

import pandas as pd

createQuery = """CREATE TABLE IF NOT EXISTS CITY (
  ID NUMBER PRIMARY KEY,
  NAME VARCHAR2(17),
  COUNTRYCODE VARCHAR2(3),
  DISTRICT VARCHAR2(20),
  POPULATION NUMBER
);
"""
cur = conn.cursor()
cur.execute(createQuery)
cur.close()

createStationQuery = """CREATE TABLE IF NOT EXISTS STATION (
  ID NUMBER PRIMARY KEY,
  CITY VARCHAR2(21),
  STATE VARCHAR2(2),
  LAT_N NUMBER,
  LONG_W NUMBER
);
"""
cur = conn.cursor()
cur.execute(createStationQuery)
cur.close()

insertQuery = """INSERT INTO STATION(ID, CITY, STATE, LAT_N, LONG_W) 
                VALUES (12, 'Tokyo', 'TOKYO', 12345, 54321), 
                (13, 'Kyoto', 'Kyoto', 12345, 54321),
                (14, 'Tokyo', 'TOKYO', 12345, 54321),
                (15, 'Thanh pho Ho Chi Minh', 'Thanh pho Ho Chi Minh', 12345, 54321);"""
cur = conn.cursor()
cur.execute(insertQuery)
cur.close()

data = pd.read_sql_query('(SELECT TOP 1 CITY,LEN(CITY) LengthOfCity FROM STATION ORDER BY LengthOfCity ASC, CITY ASC) UNION (SELECT TOP 1 CITY,LEN(CITY) LengthOfCity FROM STATION ORDER BY LengthOfCity DESC, CITY ASC);', conn)
data.head()

DatabaseError: ignored

##Task 8
Query the list of CITY names starting with vowels (i.e., a, e, i, o, or u) from STATION. Your result cannot contain duplicates.

Input Format

The STATION table is described as follows: <br>
<img src = "https://s3.amazonaws.com/hr-challenge-images/9336/1449345840-5f0a551030-Station.jpg" >

In [26]:
import sqlite3
conn = sqlite3.connect('chinook.db')

import pandas as pd

createQuery = """CREATE TABLE IF NOT EXISTS CITY (
  ID NUMBER PRIMARY KEY,
  NAME VARCHAR2(17),
  COUNTRYCODE VARCHAR2(3),
  DISTRICT VARCHAR2(20),
  POPULATION NUMBER
);
"""
cur = conn.cursor()
cur.execute(createQuery)
cur.close()

createStationQuery = """CREATE TABLE IF NOT EXISTS STATION (
  ID NUMBER PRIMARY KEY,
  CITY VARCHAR2(21),
  STATE VARCHAR2(2),
  LAT_N NUMBER,
  LONG_W NUMBER
);
"""
cur = conn.cursor()
cur.execute(createStationQuery)
cur.close()

insertQuery = """INSERT INTO STATION(ID, CITY, STATE, LAT_N, LONG_W) 
                VALUES (12, 'Tokyo', 'TOKYO', 12345, 54321), 
                (13, 'Kyoto', 'Kyoto', 12345, 54321),
                (14, 'Tokyo', 'TOKYO', 12345, 54321),
                (157, 'Akito', 'Akito', 12345, 54321);"""
cur = conn.cursor()
cur.execute(insertQuery)
cur.close()

data = pd.read_sql_query("""SELECT DISTINCT CITY from STATION 
WHERE  (CITY LIKE 'a%'
        OR CITY LIKE 'e%'
        OR CITY LIKE 'i%' 
        OR CITY LIKE 'o%'
        OR CITY LIKE 'u%');""", conn)
data.head()

    CITY
0  Akito

##Task 9
Query the list of CITY names ending with vowels (a, e, i, o, u) from STATION. Your result cannot contain duplicates.

Input Format

The STATION table is described as follows:<br>
<img src ="https://s3.amazonaws.com/hr-challenge-images/9336/1449345840-5f0a551030-Station.jpg">

In [27]:
import sqlite3
conn = sqlite3.connect('chinook.db')

import pandas as pd

createQuery = """CREATE TABLE IF NOT EXISTS CITY (
  ID NUMBER PRIMARY KEY,
  NAME VARCHAR2(17),
  COUNTRYCODE VARCHAR2(3),
  DISTRICT VARCHAR2(20),
  POPULATION NUMBER
);
"""
cur = conn.cursor()
cur.execute(createQuery)
cur.close()

createStationQuery = """CREATE TABLE IF NOT EXISTS STATION (
  ID NUMBER PRIMARY KEY,
  CITY VARCHAR2(21),
  STATE VARCHAR2(2),
  LAT_N NUMBER,
  LONG_W NUMBER
);
"""
cur = conn.cursor()
cur.execute(createStationQuery)
cur.close()

insertQuery = """INSERT INTO STATION(ID, CITY, STATE, LAT_N, LONG_W) 
                VALUES (12, 'Tokyo', 'TOKYO', 12345, 54321), 
                (13, 'Kyoto', 'Kyoto', 12345, 54321),
                (14, 'Tokyo', 'TOKYO', 12345, 54321),
                (157, 'Akito', 'Akito', 12345, 54321);"""
cur = conn.cursor()
cur.execute(insertQuery)
cur.close()

data = pd.read_sql_query("""SELECT DISTINCT CITY from STATION 
WHERE  (CITY LIKE 'a%'
        OR CITY LIKE '%e'
        OR CITY LIKE '%i' 
        OR CITY LIKE '%o'
        OR CITY LIKE '%u');""", conn)
data.head()

    CITY
0  Tokyo
1  Kyoto
2  Akito

##Task 10
Query the list of CITY names from STATION which have vowels (i.e., a, e, i, o, and u) as both their first and last characters. Your result cannot contain duplicates.

Input Format

The STATION table is described as follows:<br>
<img src ="https://s3.amazonaws.com/hr-challenge-images/9336/1449345840-5f0a551030-Station.jpg">

In [28]:
import sqlite3
conn = sqlite3.connect('chinook.db')

import pandas as pd

createQuery = """CREATE TABLE IF NOT EXISTS CITY (
  ID NUMBER PRIMARY KEY,
  NAME VARCHAR2(17),
  COUNTRYCODE VARCHAR2(3),
  DISTRICT VARCHAR2(20),
  POPULATION NUMBER
);
"""
cur = conn.cursor()
cur.execute(createQuery)
cur.close()

createStationQuery = """CREATE TABLE IF NOT EXISTS STATION (
  ID NUMBER PRIMARY KEY,
  CITY VARCHAR2(21),
  STATE VARCHAR2(2),
  LAT_N NUMBER,
  LONG_W NUMBER
);
"""
cur = conn.cursor()
cur.execute(createStationQuery)
cur.close()

insertQuery = """INSERT INTO STATION(ID, CITY, STATE, LAT_N, LONG_W) 
                VALUES (12, 'Tokyo', 'TOKYO', 12345, 54321), 
                (13, 'Kyoto', 'Kyoto', 12345, 54321),
                (14, 'Tokyo', 'TOKYO', 12345, 54321),
                (157, 'Akito', 'Akito', 12345, 54321);"""
cur = conn.cursor()
cur.execute(insertQuery)
cur.close()

data = pd.read_sql_query("""SELECT DISTINCT CITY from STATION 
WHERE CITY REGEXP '^[AIUEOaiueo].*[AIUEOaiueo]$';""", conn)
data.head()

ERROR:root:An unexpected error occurred while tokenizing input
The following traceback may be corrupted or invalid
The error message is: ('EOF in multi-line string', (1, 49))

DatabaseError: ignored

#Python

##Task 1
Task
Given an integer, perform the following conditional actions:

* If n is odd, print `Weird`
* If n is even and in the inclusive range of 2 to 5, print `Not Weird`
* If n is even and in the inclusive range of 6 to 20, print `Weird`
* If n is even and greater than 20, print `Not Weird`

Input Format

A single line containing a positive integer

Output Format

Print Weird if the number is weird; otherwise, print Not Weird.

In [36]:
if __name__ == '__main__':
    n = int(input())
    if(n % 2 == 1 or n in range(6, 21)):
      print('Weird')
    if(n % 2 == 0 and (n in range(2, 5)) or n > 20 ):
      print('Not Weird')

22
Not Weird

##Task 2
Read two integers from STDIN and print three lines where:
<ol>
  <li>The first line contains the sum of the two numbers.</li>
  <li>The second line contains the difference of the two numbers (first - second).</li>
  <li>The third line contains the product of the two numbers.</li>
</ol>

**Input Format**

The first line contains the first integer, **a**. The second line contains the second integer, **b**.

**Output Format**

Print the three lines as explained above.

In [37]:
if __name__ == '__main__':
    a = int(input())
    b = int(input())
    print(a + b)
    print(a - b)
    print(a * b)

2
3
5
-1
6

#Task 3
Task
Read an integer $N$. For all non-negative integers $i<N$ , print $i^{2}$. See the sample for details.

Input Format

The first and only line contains the integer, $N$ .

Constraints<br>
$1 \leq N \leq i$

Output Format

Print $N$ lines, one corresponding to each $i$.

In [38]:
if __name__ == '__main__':
    n = int(input())
    for i in range (1, n):
      print (i * i)

5
1
4
9
16

##Task 4
We add a Leap Day on February 29, almost every four years. The leap day is an extra, or intercalary day and we add it to the shortest month of the year, February.<br>

In the Gregorian calendar three criteria must be taken into account to identify leap years:
<ul>
<li>The year can be evenly divided by 4, is a leap year, unless:</li>
  <ul><li>The year can be evenly divided by 100, it is NOT a leap year, unless:</li>
    <ul><li>The year is also evenly divisible by 400. Then it is a leap year.</li></ul></ul></ul>
This means that in the Gregorian calendar, the years 2000 and 2400 are leap years, while 1800, 1900, 2100, 2200, 2300 and 2500 are NOT leap years.Source

**Task**<br>
<ul>
<li>You are given the year, and you have to write a function to check if the year is leap or not.</li>

  <li>Note that you have to complete the function and remaining code is given as template.</li>
  </ul>

**Input Format**

Read y, the year that needs to be checked.

**Constraints**<br>
$1900 \leq y \leq 10^{5}$

**Output Format**

Output is taken care of by the template. Your function must return a boolean value (True/False)

In [42]:
def is_leap(year):
  pass
  return year % 4 and (year % 100 != 0 or year % 400 == 0)

##Task 5
Given the participants' score sheet for your University Sports Day, you are required to find the runner-up score. You are given $n$ scores. Store them in a list and find the score of the runner-up.

**Input Format**

The first line contains $n$ . The second line contains an array $A[]$ of $n$ integers each separated by a space.

**Constraints**<br>
$2   \leq n \leq 10 $<br>
$-100 \leq A[i] \leq 100 $

Output Format

Print the runner-up score.

In [45]:
if __name__ == '__main__':
  n = int(input())
  results = list(map(int, input().split()))[:5]
  print(sorted(set(results))[-2])

5
1 2 3 4 5 6 7 8 9 10
4